-- ----------------------------
-- Table structure for `sys_permission`
-- ----------------------------
DROP TABLE IF EXISTS `sys_permission`;
CREATE TABLE `sys_permission` (
`perm_id`  int(4) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT '权限ID' ,
`perm_name`  varchar(50) NOT NULL DEFAULT '' COMMENT '权限名称' ,
`perm_caption`  varchar(20) NOT NULL DEFAULT '' COMMENT '权限标题' ,
`perm_herf`  varchar(50) DEFAULT NULL COMMENT '权限路径' ,
`perm_parent_id`  int(4) unsigned DEFAULT NULL COMMENT '权限父级ID' ,
`is_button`  tinyint(1) NULL DEFAULT NULL ,
`create_time`  datetime NULL DEFAULT NULL COMMENT '创建时间' ,
`create_by`  int(10) UNSIGNED NULL DEFAULT NULL COMMENT '创建者' ,
`update_time`  datetime NULL DEFAULT NULL COMMENT '更新时间' ,
`update_by`  int(10) UNSIGNED NULL DEFAULT NULL COMMENT '更新者' ,
`usable`  tinyint(1) UNSIGNED NOT NULL DEFAULT 1 COMMENT '是否可用' ,
`remarks`  varchar(255) DEFAULT NULL COMMENT '备注' ,
PRIMARY KEY (`perm_id`),
UNIQUE INDEX `auth_id_index` (`perm_id`) USING BTREE
)
ENGINE=InnoDB AUTO_INCREMENT=1091 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of sys_permission
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('1000', 'visit', '根目录', '/', null, '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

INSERT INTO `sys_permission` VALUES ('1001', 'sys:visit', '系统管理', '/sys/', '1000', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1002', 'sys:dist:visit', '区域管理', '/sys/dist', '1001', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1003', 'sys:org:visit', '机构管理', '/sys/org', '1001', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1004', 'sys:emp:visit', '用户管理', '/sys/emp', '1001', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1005', 'sys:role:visit', '角色管理', '/sys/role', '1001', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1006', 'sys:perm:visit', '权限管理', '/sys/perm', '1001', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1007', 'sys:dic:visit', '字典管理', '/sys/dic', '1001', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1008', 'sys:log:visit', '日志管理', '/sys/log', '1001', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1009', 'sys:notice:visit', '公告管理', '/sys/notice', '1001', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

INSERT INTO `sys_permission` VALUES ('1010', 'account:visit', '账户开户管理', '/account/', '1000', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1011', 'account:createArchive:visit', '用户建档', '/account/createArchive', '1010', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1012', 'account:entryMeter:visit', '表具入库', '/account/entryMeter', '1010', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1013', 'account:installation:visit', '挂表信息', '/account/installation', '1010', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1014', 'account:createAccount:visit', '账户开户', '/account/createAccount', '1010', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1015', 'account:mgt:visit', '账户管理', '/account/mgt', '1010', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

INSERT INTO `sys_permission` VALUES ('1016', 'recharge:visit', '充值缴费管理', '/recharge/', '1000', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1017', 'recharge:pre:visit', '预付费充值', '/recharge/pre', '1016', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1018', 'recharge:supplement:visit', '补卡充值', '/recharge/supplement', '1016', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1019', 'recharge:suff:visit', '后付费缴费', '/recharge/suff', '1016', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1020', 'recharge:invoice:visit', '发票管理', '/recharge/invoice', '1016', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

INSERT INTO `sys_permission` VALUES ('1021', 'declareorder:visit', '报修单管理', '/declareorder/', '1000', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1022', 'declareorder:business:visit', '业务功能描述', '/declareorder/business', '1021', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1023', 'declareorder:data:visit', '数据项说明', '/declareorder/data', '1021', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

INSERT INTO `sys_permission` VALUES ('1024', 'repairorder:visit', '维修补气管理', '/repairorder/', '1000', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1025', 'repairorder:entry:visit', '维修单录入提交', '/repairorder/entry', '1024', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1026', 'repairorder:supplement:visit', '维修补气', '/repairorder/supplement', '1024', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1027', 'repairorder:overuse:visit', '超用补缴结算', '/repairorder/overuse', '1024', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1028', 'repairorder:iccardinit:visit', 'IC卡初始化', '/repairorder/iccardinit', '1024', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

INSERT INTO `sys_permission` VALUES ('1029', 'financial:visit', '账务处理', '/financial/', '1000', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1030', 'financial:prestrike:visit', '预冲账处理', '/financial/prestrike', '1029', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1031', 'financial:strike:visit', '冲账处理', '/financial/strike', '1029', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

INSERT INTO `sys_permission` VALUES ('1032', 'meter:visit', '表具运行管理', '/meter/', '1000', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1033', 'meter:readmeter:visit', '抄表管理', '/meter/readmeter', '1032', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1034', 'meter:valve:visit', '阀门控制', '/meter/valve', '1032', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1035', 'meter:exception:visit', '异常情况管理', '/meter/exception', '1032', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

INSERT INTO `sys_permission` VALUES ('1036', 'querystats:visit', '查询统计', '/querystats/', '1000', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1037', 'querystats:iccard:visit', 'IC卡查询', '/querystats/iccard', '1036', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1038', 'querystats:account:visit', '开户信息查询', '/querystats/account', '1036', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1039', 'querystats:accountdetail:visit', '燃气用户信息查询', '/querystats/accountdetail', '1036', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1040', 'querystats:abnormaluser:visit', '异常用户查询', '/querystats/abnormaluser', '1036', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1041', 'querystats:data:visit', '营业数据查询', '/querystats/data', '1036', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1042', 'querystats:report:visit', '营业报表统计', '/querystats/report', '1036', '0', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');


-- ----------------------------
-- Records of 区域管理
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('1043', 'sys:dist:create', '增加', null, '1002', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1044', 'sys:dist:update', '修改', null, '1002', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1045', 'sys:dist:delete', '删除', null, '1002', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1046', 'sys:dist:retrieve', '查询', null, '1002', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1047', 'sys:dist:import', '导入', null, '1002', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1048', 'sys:dist:export', '导出', null, '1002', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

-- ----------------------------
-- Records of 机构管理
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('1049', 'sys:org:create', '增加', null, '1003', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1050', 'sys:org:update', '修改', null, '1003', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1051', 'sys:org:delete', '删除', null, '1003', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1052', 'sys:org:retrieve', '查询', null, '1003', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1053', 'sys:org:import', '导入', null, '1003', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1054', 'sys:org:export', '导出', null, '1003', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

-- ----------------------------
-- Records of 用户管理
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('1055', 'sys:emp:create', '增加', null, '1004', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1056', 'sys:emp:update', '修改', null, '1004', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1057', 'sys:emp:delete', '删除', null, '1004', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1058', 'sys:emp:retrieve', '查询', null, '1004', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1059', 'sys:emp:import', '导入', null, '1004', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1060', 'sys:emp:export', '导出', null, '1004', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

-- ----------------------------
-- Records of 角色管理
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('1061', 'sys:role:create', '增加', null, '1005', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1062', 'sys:role:update', '修改', null, '1005', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1063', 'sys:role:delete', '删除', null, '1005', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1064', 'sys:role:retrieve', '查询', null, '1005', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1065', 'sys:role:import', '导入', null, '1005', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1066', 'sys:role:export', '导出', null, '1005', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

-- ----------------------------
-- Records of 权限管理
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('1067', 'sys:perm:create', '增加', null, '1006', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1068', 'sys:perm:update', '修改', null, '1006', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1069', 'sys:perm:delete', '删除', null, '1006', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1070', 'sys:perm:retrieve', '查询', null, '1006', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1071', 'sys:perm:import', '导入', null, '1006', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1072', 'sys:perm:export', '导出', null, '1006', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

-- ----------------------------
-- Records of 字典管理
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('1073', 'sys:dic:create', '增加', null, '1007', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1074', 'sys:dic:update', '修改', null, '1007', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1075', 'sys:dic:delete', '删除', null, '1007', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1076', 'sys:dic:retrieve', '查询', null, '1007', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1077', 'sys:dic:import', '导入', null, '1007', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1078', 'sys:dic:export', '导出', null, '1007', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

-- ----------------------------
-- Records of 日志管理
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('1079', 'sys:log:create', '增加', null, '1008', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1080', 'sys:log:update', '修改', null, '1008', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1081', 'sys:log:delete', '删除', null, '1008', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1082', 'sys:log:retrieve', '查询', null, '1008', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1083', 'sys:log:import', '导入', null, '1008', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1084', 'sys:log:export', '导出', null, '1008', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');

-- ----------------------------
-- Records of 通知管理
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('1085', 'sys:notice:create', '增加', null, '1009', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1086', 'sys:notice:update', '修改', null, '1009', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1087', 'sys:notice:delete', '删除', null, '1009', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1088', 'sys:notice:retrieve', '查询', null, '1009', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1089', 'sys:notice:import', '导入', null, '1009', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');
INSERT INTO `sys_permission` VALUES ('1090', 'sys:notice:export', '导出', null, '1009', '1', '2018-08-01 15:38:26', '1000000001', '2018-08-01 15:38:31', '1000000001', '1', '');




-- ----------------------------
-- Table structure for `sys_role_perm`
-- ----------------------------
DROP TABLE IF EXISTS `sys_role_perm`;
CREATE TABLE `sys_role_perm` (
  `id` int(8) unsigned NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `role_id` int(4) unsigned NOT NULL COMMENT '角色ID',
  `perm_id` int(4) unsigned NOT NULL COMMENT '权限ID',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `create_by` int(10) unsigned DEFAULT NULL COMMENT '创建者',
  `update_time` datetime DEFAULT NULL COMMENT '更新时间',
  `update_by` int(10) unsigned DEFAULT NULL COMMENT '更新者',
  `usable` tinyint(1) unsigned DEFAULT '1' COMMENT '是否可用',
  `remarks` varchar(255) DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`),
  KEY `fk_role_perm` (`role_id`) USING BTREE,
  KEY `fk_perm_id` (`perm_id`),
  CONSTRAINT `fk_perm_id` FOREIGN KEY (`perm_id`) REFERENCES `sys_permission` (`perm_id`),
  CONSTRAINT `fk_role_id` FOREIGN KEY (`role_id`) REFERENCES `sys_role` (`role_id`)
) ENGINE=InnoDB AUTO_INCREMENT=57 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of sys_role_perm
-- ----------------------------
INSERT INTO `sys_role_perm` VALUES ('1', '1001', '1000', '2018-07-18 16:26:55', '1000000000', '2018-07-18 16:26:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('2', '1001', '1001', '2018-08-01 16:22:28', '1000000000', '2018-08-01 16:22:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('3', '1001', '1002', '2018-08-15 16:18:02', '1000000000', '2018-08-15 16:18:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('4', '1001', '1003', '2018-08-29 16:13:35', '1000000000', '2018-08-29 16:13:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('5', '1001', '1004', '2018-09-12 16:09:07', '1000000000', '2018-09-12 16:09:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('6', '1001', '1005', '2018-09-26 16:04:41', '1000000000', '2018-09-26 16:05:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('7', '1001', '1006', '2018-10-10 16:00:14', '1000000000', '2018-10-10 16:00:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('8', '1001', '1007', '2018-10-24 15:55:47', '1000000000', '2018-10-24 15:56:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('9', '1001', '1008', '2018-11-07 15:51:20', '1000000000', '2018-11-07 15:52:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('10', '1001', '1009', '2018-11-21 15:46:53', '1000000000', '2018-11-21 15:47:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('11', '1001', '1010', '2018-12-05 15:42:26', '1000000000', '2018-12-05 15:43:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('12', '1001', '1011', '2018-12-19 15:37:59', '1000000000', '2018-12-19 15:39:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('13', '1001', '1012', '2019-01-02 15:33:32', '1000000000', '2019-01-02 15:34:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('14', '1001', '1013', '2019-01-16 15:29:05', '1000000000', '2019-01-16 15:30:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('15', '1001', '1014', '2019-01-30 15:24:38', '1000000000', '2019-01-30 15:26:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('16', '1001', '1015', '2019-02-13 15:20:11', '1000000000', '2019-02-13 15:21:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('17', '1001', '1016', '2019-02-27 15:15:44', '1000000000', '2019-02-27 15:17:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('18', '1001', '1017', '2019-03-13 15:11:17', '1000000000', '2019-03-13 15:13:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('19', '1001', '1018', '2019-03-27 15:06:50', '1000000000', '2019-03-27 15:08:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('20', '1001', '1019', '2019-04-10 15:02:23', '1000000000', '2019-04-10 15:04:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('21', '1001', '1020', '2019-04-24 14:57:56', '1000000000', '2019-04-24 15:00:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('22', '1001', '1021', '2019-05-08 14:53:29', '1000000000', '2019-05-08 14:55:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('23', '1001', '1022', '2019-05-22 14:49:02', '1000000000', '2019-05-22 14:51:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('24', '1001', '1023', '2019-06-05 14:44:35', '1000000000', '2019-06-05 14:47:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('25', '1001', '1024', '2019-06-19 14:40:08', '1000000000', '2019-06-19 14:42:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('26', '1001', '1025', '2019-07-03 14:35:41', '1000000000', '2019-07-03 14:38:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('27', '1001', '1026', '2019-07-17 14:31:14', '1000000000', '2019-07-17 14:34:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('28', '1001', '1027', '2019-07-31 14:26:47', '1000000000', '2019-07-31 14:29:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('29', '1001', '1028', '2019-08-14 14:22:20', '1000000000', '2019-08-14 14:25:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('30', '1001', '1029', '2019-08-28 14:17:53', '1000000000', '2019-08-28 14:21:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('31', '1001', '1030', '2019-09-11 14:13:26', '1000000000', '2019-09-11 14:16:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('32', '1001', '1031', '2019-09-25 14:08:59', '1000000000', '2019-09-25 14:12:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('33', '1001', '1032', '2019-10-09 14:04:32', '1000000000', '2019-10-09 14:08:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('34', '1001', '1033', '2019-10-23 14:00:05', '1000000000', '2019-10-23 14:03:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('35', '1001', '1034', '2019-11-06 13:55:38', '1000000000', '2019-11-06 13:59:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('36', '1001', '1035', '2019-11-20 13:51:11', '1000000000', '2019-11-20 13:55:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('37', '1001', '1036', '2019-12-04 13:46:44', '1000000000', '2019-12-04 13:50:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('38', '1001', '1037', '2019-12-18 13:42:17', '1000000000', '2019-12-18 13:46:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('39', '1001', '1038', '2020-01-01 13:37:50', '1000000000', '2020-01-01 13:42:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('40', '1001', '1039', '2020-01-15 13:33:23', '1000000000', '2020-01-15 13:37:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('41', '1001', '1040', '2020-01-29 13:28:56', '1000000000', '2020-01-29 13:33:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('42', '1001', '1041', '2020-02-12 13:24:29', '1000000000', '2020-02-12 13:29:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('43', '1001', '1042', '2020-02-26 13:20:02', '1000000000', '2020-02-26 13:24:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('44', '1001', '1043', '2020-03-11 13:15:35', '1000000000', '2020-03-11 13:20:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('45', '1001', '1044', '2020-03-25 13:11:08', '1000000000', '2020-03-25 13:16:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('46', '1001', '1045', '2020-04-08 13:06:41', '1000000000', '2020-04-08 13:11:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('47', '1001', '1046', '2020-04-22 13:02:14', '1000000000', '2020-04-22 13:07:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('48', '1001', '1047', '2020-05-06 12:57:47', '1000000000', '2020-05-06 13:03:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('49', '1001', '1048', '2020-05-20 12:53:20', '1000000000', '2020-05-20 12:58:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('50', '1001', '1049', '2020-06-03 12:48:53', '1000000000', '2020-06-03 12:54:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('51', '1001', '1050', '2020-06-17 12:44:26', '1000000000', '2020-06-17 12:50:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('52', '1001', '1051', '2020-07-01 12:39:59', '1000000000', '2020-07-01 12:45:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('53', '1001', '1052', '2020-07-15 12:35:32', '1000000000', '2020-07-15 12:41:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('54', '1001', '1053', '2020-07-29 12:31:05', '1000000000', '2020-07-29 12:37:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('55', '1001', '1054', '2020-08-12 12:26:38', '1000000000', '2020-08-12 12:32:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('56', '1001', '1055', '2020-08-26 12:22:11', '1000000000', '2020-08-26 12:28:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('57', '1001', '1056', '2018-12-05 15:42:26', '1000000000', '2018-12-05 15:43:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('58', '1001', '1057', '2018-12-19 15:37:59', '1000000000', '2018-12-19 15:39:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('59', '1001', '1058', '2019-01-02 15:33:32', '1000000000', '2019-01-02 15:34:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('60', '1001', '1059', '2019-01-16 15:29:05', '1000000000', '2019-01-16 15:30:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('61', '1001', '1060', '2019-01-30 15:24:38', '1000000000', '2019-01-30 15:26:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('62', '1001', '1061', '2019-02-13 15:20:11', '1000000000', '2019-02-13 15:21:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('63', '1001', '1062', '2019-02-27 15:15:44', '1000000000', '2019-02-27 15:17:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('64', '1001', '1063', '2019-03-13 15:11:17', '1000000000', '2019-03-13 15:13:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('65', '1001', '1064', '2019-03-27 15:06:50', '1000000000', '2019-03-27 15:08:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('66', '1001', '1065', '2019-04-10 15:02:23', '1000000000', '2019-04-10 15:04:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('67', '1001', '1066', '2019-04-24 14:57:56', '1000000000', '2019-04-24 15:00:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('68', '1001', '1067', '2019-05-08 14:53:29', '1000000000', '2019-05-08 14:55:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('69', '1001', '1068', '2019-05-22 14:49:02', '1000000000', '2019-05-22 14:51:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('70', '1001', '1069', '2019-06-05 14:44:35', '1000000000', '2019-06-05 14:47:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('71', '1001', '1070', '2019-06-19 14:40:08', '1000000000', '2019-06-19 14:42:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('72', '1001', '1071', '2019-07-03 14:35:41', '1000000000', '2019-07-03 14:38:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('73', '1001', '1072', '2019-07-17 14:31:14', '1000000000', '2019-07-17 14:34:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('74', '1001', '1073', '2019-07-31 14:26:47', '1000000000', '2019-07-31 14:29:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('75', '1001', '1074', '2019-08-14 14:22:20', '1000000000', '2019-08-14 14:25:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('76', '1001', '1075', '2019-08-28 14:17:53', '1000000000', '2019-08-28 14:21:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('77', '1001', '1076', '2019-09-11 14:13:26', '1000000000', '2019-09-11 14:16:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('78', '1001', '1077', '2019-09-25 14:08:59', '1000000000', '2019-09-25 14:12:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('79', '1001', '1078', '2019-10-09 14:04:32', '1000000000', '2019-10-09 14:08:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('80', '1001', '1079', '2019-10-23 14:00:05', '1000000000', '2019-10-23 14:03:56', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('81', '1001', '1080', '2019-11-06 13:55:38', '1000000000', '2019-11-06 13:59:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('82', '1001', '1081', '2019-11-20 13:51:11', '1000000000', '2019-11-20 13:55:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('83', '1001', '1082', '2019-12-04 13:46:44', '1000000000', '2019-12-04 13:50:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('84', '1001', '1083', '2019-12-18 13:42:17', '1000000000', '2019-12-18 13:46:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('85', '1001', '1084', '2020-01-01 13:37:50', '1000000000', '2020-01-01 13:42:15', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('86', '1001', '1085', '2020-01-15 13:33:23', '1000000000', '2020-01-15 13:37:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('87', '1001', '1086', '2020-01-29 13:28:56', '1000000000', '2020-01-29 13:33:36', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('88', '1001', '1087', '2020-02-12 13:24:29', '1000000000', '2020-02-12 13:29:16', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('89', '1001', '1088', '2020-02-26 13:20:02', '1000000000', '2020-02-26 13:24:55', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('90', '1001', '1089', '2020-03-11 13:15:35', '1000000000', '2020-03-11 13:20:35', '1000000000', '1', '');
INSERT INTO `sys_role_perm` VALUES ('91', '1001', '1090', '2020-03-25 13:11:08', '1000000000', '2020-03-25 13:16:16', '1000000000', '1', '');

